backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def authorize_request
    puts "Headers: #{request.headers.to_h.select{|k,v| k.include?('AUTH')}}"
    puts "Authorization header: #{request.headers['Authorization']}"
    puts "HTTP_AUTHORIZATION header: #{request.headers['HTTP_AUTHORIZATION']}"

    header = request.headers['Authorization'] || request.headers['HTTP_AUTHORIZATION']
    token = header.split(' ')&.last if header

    if token.blank?
      return render json: { error: 'Missing token' }, status: :unauthorized
    end
    begin
      decoded = JwtService.decode(token)
      puts "decoded string: #{decoded.inspect}"
      if decoded.nil?
        return render json: { error: 'Invalid token' }, status: :unauthorized
      end
      @current_user = User.find(decoded['user_id'])