backend/app/controllers/discussion_threads_controller.rb

    def index
        discussion_threads = DiscussionThread.where(tenant_id: current_user.tenant_id, project_id: params[:project_id], task_id: params[:task_id])
        if discussion_threads.any?
---
SELECT "discussion_threads".* FROM "discussion_threads" WHERE "discussion_threads"."tenant_id" = 1 AND "discussion_threads"."project_id" = 3 AND "discussion_threads"."task_id" = 1
SELECT 1 AS one FROM "discussion_threads" WHERE "discussion_threads"."tenant_id" = 1 AND "discussion_threads"."project_id" = '3' AND "discussion_threads"."task_id" = 1 LIMIT 1

    def create
        discussion_thread = DiscussionThread.new(discussion_thread_params)
        discussion_thread.project_id = params[:project_id]
        discussion_thread.task_id = params[:task_id]
        discussion_thread.tenant_id = current_user.tenant_id
        discussion_thread.created_by_id = current_user.id

        if DiscussionThread.exists?(title: discussion_thread.title,tenant_id: current_user.tenant_id, project_id: params[:project_id], task_id: params[:task_id])
            render json: {message: "discussion_thread already exists"}, status: :unprocessable_entity
        elsif discussion_thread.save
---
INSERT INTO "discussion_threads" ("tenant_id", "task_id", "title", "body", "status", "created_by_id", "created_at", "updated_at", "project_id") VALUES (1, 1, 'Write documentation', 'This is a test discussion thread.', 0, 1, '2025-11-28 03:19:18.695953', '2025-11-28 03:19:18.695953', 3) RETURNING "id"
SELECT "projects".* FROM "projects" WHERE "projects"."deleted_at" IS NULL AND "projects"."tenant_id" = 1 AND "projects"."id" = 3 LIMIT 1
SELECT "tasks".* FROM "tasks" WHERE "tasks"."deleted_at" IS NULL AND "tasks"."tenant_id" = 1 AND "tasks"."project_id" = 3 AND "tasks"."id" = 1 LIMIT 1
SELECT 1 AS one FROM "discussion_threads" WHERE "discussion_threads"."title" = 'Write documentation' AND "discussion_threads"."tenant_id" = 1 AND "discussion_threads"."task_id" = 1 LIMIT 1

    def update
        if @discussion_thread.update(discussion_thread_params)
---
UPDATE "discussion_threads" SET "body" = 'Documentation updated1', "updated_at" = '2025-11-28 03:24:20.139791' WHERE "discussion_threads"."id" = 1

    def set_project
        @project = Project.active.where(tenant_id: current_user.tenant_id).find_by(id: params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."deleted_at" IS NULL AND "projects"."tenant_id" = 2 AND "projects"."id" = 3 LIMIT 1

    def set_task
        @task = Task.active.where(tenant_id: current_user.tenant_id, project_id:  @project.id).find_by(id: params[:task_id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."deleted_at" IS NULL AND "tasks"."tenant_id" = 1 AND "tasks"."project_id" = 3 AND "tasks"."id" = 1 LIMIT 1

    def set_discussion_thread
        @discussion_thread = DiscussionThread.where(tenant_id: current_user.tenant_id, project_id: @project.id, task_id: @task.id).find_by(id: params[:id])
---
SELECT "discussion_threads".* FROM "discussion_threads" WHERE "discussion_threads"."tenant_id" = 1 AND "discussion_threads"."project_id" = 3 AND "discussion_threads"."task_id" = 1 AND "discussion_threads"."id" = 1 LIMIT 1