backend/app/controllers/projects_controller.rb

    def create
        project = Project.new(project_params)
        project.tenant_id = current_user.tenant_id
        project.created_by_id = current_user.id

        if Project.exists?(name: project.name,tenant_id: current_user.tenant_id)
---
SELECT 1 AS one FROM "projects" WHERE "projects"."name" = 'Project C' AND "projects"."id" != 2 AND "projects"."tenant_id" = 1 LIMIT 1

    def destroy
        if @project.tasks.exists?
---
SELECT 1 AS one FROM "tasks" WHERE "tasks"."project_id" = 3 LIMIT 1

    def set_project
        @project = Project.active.where(tenant_id: current_user.tenant_id).find_by(id: params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."deleted_at" IS NULL AND "projects"."tenant_id" = 1 AND "projects"."id" = 1 LIMIT 1