backend/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."deleted_at" IS NULL AND "projects"."tenant_id" = 1
SELECT "projects".* FROM "projects"
SELECT 1 AS one FROM "projects" WHERE "projects"."deleted_at" IS NULL AND "projects"."tenant_id" = 1 LIMIT 1
---
    def index
        projects = Project.active.where(tenant_id: current_user.tenant_id)
        if projects.any?

INSERT INTO "projects" ("tenant_id", "name", "description", "status", "target_date", "created_by_id", "created_at", "updated_at", "deleted_at") VALUES (1, 'Project D', 'Test project', 0, '2025-12-31', 2, '2025-11-27 23:01:08.382445', '2025-11-27 23:01:08.382445', NULL) RETURNING "id"
SELECT 1 AS one FROM "projects" WHERE "projects"."name" = 'Project D' AND "projects"."tenant_id" = 1 LIMIT 1
---
    def create
        project = Project.new(project_params)
        project.tenant_id = current_user.tenant_id
        project.created_by_id = current_user.id

        if Project.exists?(name: project.name,tenant_id: current_user.tenant_id)
            render json: {message: "Project already exists"}, status: :unprocessable_entity
        elsif project.save

UPDATE "projects" SET "name" = 'Project C', "updated_at" = '2025-11-27 22:56:23.079513' WHERE "projects"."id" = 2
---
    def update
        if @project.update(project_params)

UPDATE "projects" SET "updated_at" = '2025-11-27 22:57:07.496604', "deleted_at" = '2025-11-27 22:57:07.475907' WHERE "projects"."id" = 2
---
    def destroy
        if @project.update(deleted_at: Time.current)

SELECT "projects".* FROM "projects" WHERE "projects"."deleted_at" IS NULL AND "projects"."tenant_id" = 1 AND "projects"."id" = 2 LIMIT 1
---
    def set_project
        @project = Project.active.where(tenant_id: current_user.tenant_id).find_by(id: params[:id])