backend/app/controllers/tasks_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."deleted_at" IS NULL AND "projects"."tenant_id" = 1 AND "projects"."id" = 3 LIMIT 1
---
    def set_project
        @project = Project.active.where(tenant_id: current_user.tenant_id).find_by(id: params[:project_id])