backend/app/controllers/tasks_controller.rb

    def index
        tasks = Task.active.where(tenant_id: current_user.tenant_id, project_id: params[:project_id])
        if tasks.any?
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."deleted_at" IS NULL AND "tasks"."tenant_id" = 1 AND "tasks"."project_id" = 3
SELECT 1 AS one FROM "tasks" WHERE "tasks"."deleted_at" IS NULL AND "tasks"."tenant_id" = 1 AND "tasks"."project_id" = 3 LIMIT 1

        task = Task.new(task_params)
        task.project_id = params[:project_id]
        task.tenant_id = current_user.tenant_id
        task.created_by_id = current_user.id

        if Task.exists?(title: task.title,tenant_id: current_user.tenant_id, project_id: params[:project_id])
            render json: {message: "Task already exists"}, status: :unprocessable_entity
        elsif task.save
---
INSERT INTO "tasks" ("tenant_id", "project_id", "title", "description", "status", "priority", "assignee_id", "created_by_id", "due_date", "completed_at", "created_at", "updated_at", "deleted_at") VALUES (1, 3, 'Write documentation', 'Write docs for new feature', 0, 1, 2, 1, '2025-12-12', NULL, '2025-11-28 01:53:59.445427', '2025-11-28 01:53:59.445427', NULL) RETURNING "id"
SELECT "projects".* FROM "projects" WHERE "projects"."deleted_at" IS NULL AND "projects"."tenant_id" = 1 AND "projects"."id" = 3 LIMIT 1
SELECT 1 AS one FROM "tasks" WHERE "tasks"."title" = 'Write documentation' AND "tasks"."tenant_id" = 1 AND "tasks"."project_id" = 3 LIMIT 1

    def update
        update_data = task_params
        if task_params[:status] == "done" && @task.status != "done"
            update_data = update_data.merge(completed_at: Time.current)
        end
        if @task.update(update_data)
---
UPDATE "tasks" SET "description" = 'Documentation updated1', "status" = 0, "completed_at" = '2025-11-28 02:05:31.629997', "updated_at" = '2025-11-28 02:05:31.643945' WHERE "tasks"."id" = 2

    def set_project
        @project = Project.active.where(tenant_id: current_user.tenant_id).find_by(id: params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."deleted_at" IS NULL AND "projects"."tenant_id" = 1 AND "projects"."id" = 3 LIMIT 1

    def set_task
        @task = Task.active.where(tenant_id: current_user.tenant_id,project_id: params[:project_id]).find_by(id: params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."deleted_at" IS NULL AND "tasks"."tenant_id" = 1 AND "tasks"."project_id" = 3 AND "tasks"."id" = 1 LIMIT 1