backend/app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("email", "password_digest", "role", "tenant_id", "created_at", "updated_at") VALUES ('admin@t1.com', '$2a$12$ypKEuwywCGIXSHzOA9aeeOxY3KSWQVN4BMEIjp7vcphtPhsfSB3PO', 2, 1, '2025-11-27 16:36:53.602769', '2025-11-27 16:36:53.602769') RETURNING "id"

    def login
        user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'a@b.com' LIMIT 1